zhengjy926/bsp/stm32/bsp_uart.c
        HAL_NVIC_SetPriority(UART7_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(UART7_IRQn);
        break;
#endif

#ifdef BSP_USING_UART8
    case UART8_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART8;
        PeriphClkInit.Uart8ClockSelection = RCC_UART8CLKSOURCE_PCLK1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            log_e("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_UART8_CLK_ENABLE();
    
        GPIO_InitStruct.Pin = BSP_UART8_TX_PIN;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
        GPIO_InitStruct.Pull = GPIO_PULLUP;
#ifndef STM32F1
        GPIO_InitStruct.Alternate = GPIO_AF8_UART8;
#endif
        HAL_GPIO_Init(BSP_UART8_TX_PORT, &GPIO_InitStruct);

        
#if defined(STM32F1)
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
#else
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
#endif
        GPIO_InitStruct.Pin = BSP_UART8_RX_PIN;
        HAL_GPIO_Init(BSP_UART8_RX_PORT, &GPIO_InitStruct);
        
        HAL_NVIC_SetPriority(UART8_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(UART8_IRQn);
        break;
#endif

#ifdef BSP_USING_LPUART1
    case LPUART1_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_LPUART1;
        PeriphClkInit.Lpuart1ClockSelection = RCC_LPUART1CLKSOURCE_PCLK1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            log_e("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_LPUART1_CLK_ENABLE();
    
        GPIO_InitStruct.Pin = BSP_LPUART1_TX_PIN;
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
        GPIO_InitStruct.Pull = GPIO_PULLUP;
#ifndef STM32F1
        GPIO_InitStruct.Alternate = GPIO_AF8_LPUART1;
#endif
        HAL_GPIO_Init(BSP_LPUART1_TX_PORT, &GPIO_InitStruct);

        
#if defined(STM32F1)
        GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
#else
        GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
#endif
        GPIO_InitStruct.Pin = BSP_LPUART1_RX_PIN;
        HAL_GPIO_Init(BSP_LPUART1_RX_PORT, &GPIO_InitStruct);

        HAL_NVIC_SetPriority(LPUART1_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(LPUART1_IRQn);
        break;
#endif
    default:
        return;
    }
}

static bool stm32_uart_tx_is_busy(struct serial *port)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;

    return (stm_uart->huart.gState == HAL_UART_STATE_BUSY_TX) ? true : false;
}

/**
  * @brief  UART transmit using DMA or interrupt mode
  * @param  port: Pointer to serial device
  * @param  buf: Pointer to data buffer
  * @param  size: Number of bytes to transmit
  * @retval 0 on success, negative error code on failure
  */
static int stm32_uart_tx(Serial_t *port, const void *buf, size_t size)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;
    HAL_StatusTypeDef status;
    const uint8_t *data = (const uint8_t*)buf;

    if (!port || !buf || size == 0 || !stm_uart) {
        return -ERR_INVAL;
    }

    if (size > UINT16_MAX) {
        return -ERR_INVAL;
    }

    if (stm_uart->huart.hdmatx != NULL) {
        status = HAL_UART_Transmit_DMA(&stm_uart->huart, data, (uint16_t)size);
    } else {
        status = HAL_UART_Transmit_IT(&stm_uart->huart, data, (uint16_t)size);
    }

    if (status != HAL_OK) {
        log_e("HAL_UART_Transmit_DMA/IT failed");
        return -ERR_IO;
    }

    return 0;
}

/**
  * @brief  Start UART DMA/Interrupt reception
  * @param  port: Pointer to serial device
  * @retval 0 on success, negative error code on failure
  */
static int stm32_uart_start_rx(Serial_t *port)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;
    HAL_StatusTypeDef status;

    if (!port || !stm_uart) {
        return -ERR_INVAL;
    }

    // 重置位置计数器
    stm_uart->last_pos = 0;

    // 重新开启中断接收
    if (stm_uart->huart.hdmarx != NULL) {
        /* 使用DMA模式接收 */
        status = HAL_UARTEx_ReceiveToIdle_DMA(&stm_uart->huart,
                                             stm_uart->rx_cache_buf,
                                             stm_uart->rx_cache_bufsz);
    } else {
        /* 使用中断模式接收，单字节接收 */
        status = HAL_UARTEx_ReceiveToIdle_IT(&stm_uart->huart, stm_uart->rx_cache_buf, stm_uart->rx_cache_bufsz);
    }

    if (status != HAL_OK) {
        log_e("HAL_UART_Receive_DMA/IT failed");
        return -ERR_IO;
    }

    return 0;
}

/**
  * @brief  Initialize STM32 USART hardware
  * @retval 0 on success, negative error code on failure
  */
int BSP_UART_Init(void)
{
    int ret = 0;

    for (uint8_t i = 0; i < UART_INDEX_MAX; i++)
    {
        serial_dev[i].prv_data = &stm_uart_drv[i];
        serial_dev[i].ops = &stm_uart_ops;

        ret = Serial_Register(&serial_dev[i], stm_uart_drv[i].name);
        if (ret != 0) {
            return ret;
        }
    }

#if defined(BSP_USING_UART1)
    stm_uart_drv[UART1_INDEX].rx_cache_buf = uart1_rx_cache_buf;
    stm_uart_drv[UART1_INDEX].rx_cache_bufsz = sizeof(uart1_rx_cache_buf);
    serial_dev[UART1_INDEX].rx_buf   = uart1_rx_buf;
    serial_dev[UART1_INDEX].rx_bufsz = sizeof(uart1_rx_buf);
    serial_dev[UART1_INDEX].tx_buf   = uart1_tx_buf;
    serial_dev[UART1_INDEX].tx_bufsz = sizeof(uart1_tx_buf);
#endif

#if defined(BSP_USING_UART2)
    stm_uart_drv[UART2_INDEX].rx_cache_buf = uart2_rx_cache_buf;
    stm_uart_drv[UART2_INDEX].rx_cache_bufsz = sizeof(uart2_rx_cache_buf);
    serial_dev[UART2_INDEX].rx_buf   = uart2_rx_buf;
    serial_dev[UART2_INDEX].rx_bufsz = sizeof(uart2_rx_buf);
    serial_dev[UART2_INDEX].tx_buf   = uart2_tx_buf;
    serial_dev[UART2_INDEX].tx_bufsz = sizeof(uart2_tx_buf);
#endif

#if defined(BSP_USING_UART3)
    stm_uart_drv[UART3_INDEX].rx_cache_buf = uart3_rx_cache_buf;
    stm_uart_drv[UART3_INDEX].rx_cache_bufsz = sizeof(uart3_rx_cache_buf);
    serial_dev[UART3_INDEX].rx_buf   = uart3_rx_buf;
    serial_dev[UART3_INDEX].rx_bufsz = sizeof(uart3_rx_buf);
    serial_dev[UART3_INDEX].tx_buf   = uart3_tx_buf;
    serial_dev[UART3_INDEX].tx_bufsz = sizeof(uart3_tx_buf);
#endif

#if defined(BSP_USING_UART4)
    stm_uart_drv[UART4_INDEX].rx_cache_buf = uart4_rx_cache_buf;
    stm_uart_drv[UART4_INDEX].rx_cache_bufsz = sizeof(uart4_rx_cache_buf);
    serial_dev[UART4_INDEX].rx_buf   = uart4_rx_buf;
    serial_dev[UART4_INDEX].rx_bufsz = sizeof(uart4_rx_buf);
    serial_dev[UART4_INDEX].tx_buf   = uart4_tx_buf;
    serial_dev[UART4_INDEX].tx_bufsz = sizeof(uart4_tx_buf);
#endif

