zhengjy926/bsp/stm32/bsp_uart.c
#if defined(BSP_USING_UART5)
    void UART5_IRQHandler(void)
    {
        HAL_UART_IRQHandler(&stm_uart_drv[UART5_INDEX].huart);
    }
#if defined(BSP_UART5_RX_USING_DMA)
    void UART5_DMA_RX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART5_INDEX].hdma_uart_rx);
    }
#endif // BSP_UART5_RX_USING_DMA
#if defined(BSP_UART5_TX_USING_DMA)
    void UART5_DMA_TX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART5_INDEX].hdma_uart_tx);
    }
#endif // BSP_UART5_TX_USING_DMA
#endif // BSP_USING_UART5

#if defined(BSP_USING_UART6)
    void USART6_IRQHandler(void)
    {
        HAL_UART_IRQHandler(&stm_uart_drv[UART6_INDEX].huart);
    }
#if defined(BSP_UART6_RX_USING_DMA)
    void UART6_DMA_RX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART6_INDEX].hdma_uart_rx);
    }
#endif // BSP_UART6_RX_USING_DMA
#if defined(BSP_UART6_TX_USING_DMA)
    void UART6_DMA_TX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART6_INDEX].hdma_uart_tx);
    }
#endif // BSP_UART6_TX_USING_DMA
#endif // BSP_USING_UART6

#if defined(BSP_USING_UART7)
    void UART7_IRQHandler(void)
    {
        HAL_UART_IRQHandler(&stm_uart_drv[UART7_INDEX].huart);
    }
#if defined(BSP_UART7_RX_USING_DMA)
    void UART7_DMA_RX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART7_INDEX].hdma_uart_rx);
    }
#endif // BSP_UART7_RX_USING_DMA
#if defined(BSP_UART7_TX_USING_DMA)
    void UART7_DMA_TX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART7_INDEX].hdma_uart_tx);
    }
#endif // BSP_UART7_TX_USING_DMA
#endif // BSP_USING_UART7

#if defined(BSP_USING_UART8)
    void UART8_IRQHandler(void)
    {
        HAL_UART_IRQHandler(&stm_uart_drv[UART8_INDEX].huart);
    }
#if defined(BSP_UART8_RX_USING_DMA)
    void UART8_DMA_RX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART8_INDEX].hdma_uart_rx);
    }
#endif // BSP_UART8_RX_USING_DMA
#if defined(BSP_UART8_TX_USING_DMA)
    void UART8_DMA_TX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[UART8_INDEX].hdma_uart_tx);
    }
#endif // BSP_UART8_TX_USING_DMA
#endif // BSP_USING_UART8

#if defined(BSP_USING_LPUART1)
    void LPUART1_IRQHandler(void)
    {
        HAL_UART_IRQHandler(&stm_uart_drv[LPUART1_INDEX].huart);
    }
#if defined(BSP_LPUART1_RX_USING_DMA)
    void LPUART1_DMA_RX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[LPUART1_INDEX].hdma_uart_rx);
    }
#endif // BSP_LPUART1_RX_USING_DMA
#if defined(BSP_LPUART1_TX_USING_DMA)
    void LPUART1_DMA_TX_IRQHandler(void)
    {
        HAL_DMA_IRQHandler(&stm_uart_drv[LPUART1_INDEX].hdma_uart_tx);
    }
#endif // BSP_LPUART1_TX_USING_DMA
#endif // BSP_USING_LPUART1

#endif /* defined(HAL_UART_MODULE_ENABLED) */
